//转义字符
//在屏幕上打印"c:\test\test.c"
/**********************************************************************************
#include<stdio.h>
int main()
{
	printf("c:\\test\\test.c \n"); //此处无法打印出\，其原因为在此处进行了转义
	printf("ab\ncd\n");//此处\n为转义字符：换行
	printf("%s\n","\'");  //打印一个'
	return 0;
}

 *//*****************************************************************************

#include <stdio.h>
int main()
{
	printf("%c\n",'\130'); //8进制的130是十进制的88,在ASCII中，X的ASCII码的值就为88
	printf("%c\n",'\101');

	return 0;
}
*///******************************************************************************
//计算长度
#include <stdio.h>
#include <string.h>
int main()
{
	printf("%d\n",strlen("c:\test\328\test.c"));
	return 0;
}