#include <stdio.h>
age = 20;
int main()
{
	int age = 20;   //创建一个变量；类型  变量的名字 = 数值
	double weight = 60.5; //创建一个体重的变量

	age=age+1;  //年龄+1
	weight=weight-5; //体重-5
	printf("%d\n",age);
	printf("%lf\n",weight);  //double打印使用%lf打印
	return 0;
}

/***********************************************************

#include <stdio.h>
a = 20;  //全局变量
int main()
{
	int a = 10   //局部变量
	printf("%d\n",a);
	return 0;
}
//局部变量优先于全局变量


*///***********************************************************



/************************************************************
局部变量与全局变量
{}内部为局部变量
{}外部为全局变量
当局部变量与全局与全局变量冲突的情况下，局部优先


%d  --整型
%f  --float
%lf --double
*///***********************************************************