/*const修饰的常变量*****************************************************************************
#include <stdio.h>
int main()
{

const int num =10;  //添加了const后，num就是常变量---就具常属性（不能被改变的属性）
num=20;
printf("num=%d\n",num);
return 0;
}
//运行会出现报错，其原因时const修饰的常变量不能被改变
*///*****************************************************************************************

/*#define定义的标识常量符********************************************************************
#include <stdio.h>
#define MAX 10000
int main()
{
	//MAX=2000 //此写法为错误。#define定义的常量无法再次修改
	int n=MAX;
	printf("n=%d\n",n);
	return 0;
}
*//*******************************************************************************************

/*枚举常量--可以一一列举的常量****************************************************************/

  //定义一个性别的枚举常量

#include <stdio.h>
enum Sex //定义一个性别的枚举常量
{   //这种枚举实例的变量未来可能取值
	MALE=3,  //枚举常量,默认从0开始。赋初值为3
	FEMALE,
	SECRET
	};
int main()
{
	enum Sex s =MALE;
	printf("%d\n",MALE);
	printf("%d\n",FEMALE);
	printf("%d\n",SECRET);
	return 0;
}
